## Plan Result (fxa-webhook-proxy-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/197414)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 26 to change, 1 to destroy.</code></pre>

* Update
  * aws_acm_certificate.apigateway-lambda_fxa-events-apigateway-lambda_api-gateway-certificate_AB4BFA3E
  * aws_api_gateway_domain_name.apigateway-lambda_fxa-events-apigateway-lambda_api-gateway-domain-name_AAD407DE
  * aws_api_gateway_rest_api.apigateway-lambda_api-gateway-rest_FD4A1018
  * aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9
  * aws_cloudwatch_log_group.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_log-group_FCA0AB36
  * aws_cloudwatch_log_group.proxy-lambda_fxa-events-sqs-lambda_log-group_026C85E5
  * aws_codedeploy_app.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-app_36CDF2A9
  * aws_codedeploy_app.proxy-lambda_fxa-events-sqs-lambda_lambda-code-deploy_code-deploy-app_BC3071ED
  * aws_codedeploy_deployment_group.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda-code-deploy_code-deployment-group_C7221F61
  * aws_codedeploy_deployment_group.proxy-lambda_fxa-events-sqs-lambda_lambda-code-deploy_code-deployment-group_768043C9
  * aws_iam_policy.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_execution-policy_3C519FF1
  * aws_iam_policy.proxy-lambda_fxa-events-sqs-lambda_execution-policy_42E5C2FC
  * aws_iam_policy.proxy-lambda_fxa-events-sqs-lambda_sqs-policy_C749EED1
  * aws_iam_role.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_execution-role_0FCA3369
  * aws_iam_role.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-role_2351D7DE
  * aws_iam_role.proxy-lambda_fxa-events-sqs-lambda_execution-role_49DCFF7B
  * aws_iam_role.proxy-lambda_fxa-events-sqs-lambda_lambda-code-deploy_code-deploy-role_EAFFD8C6
  * aws_lambda_function.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_06645171
  * aws_lambda_function.proxy-lambda_fxa-events-sqs-lambda_39345609
  * aws_route53_zone.apigateway-lambda_fxa-events-apigateway-lambda_base-dns_subhosted_zone_8A609C89
  * aws_s3_bucket.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_code-bucket_C7C951C2
  * aws_s3_bucket.proxy-lambda_fxa-events-sqs-lambda_code-bucket_18BE403F
  * aws_sns_topic.pagerduty_alarm-critical-topic_F1534579
  * aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3
  * aws_sqs_queue.sqs-queue_redrive_sqs_queue_7787A983
  * aws_sqs_queue.sqs-queue_sqs_queue_46EA6754
* Replace
  * aws_lambda_event_source_mapping.proxy-lambda_fxa-events-sqs-lambda_lambda_event_source_mapping_0005C71C



<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_execution-policy-document_E70A7233 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_execution-policy-document_E70A7233" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)
      + version       = "2012-10-17"

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*:*:*",
            ]
        }
      + statement {
          + actions   = [
              + "sqs:SendMessage",
              + "sqs:SendMessageBatch",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:us-east-1:996905175585:FxAWebhookProxy-Prod-Queue",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:AttachNetworkInterface",
              + "ec2:CreateNetworkInterface",
              + "ec2:DeleteNetworkInterface",
              + "ec2:DescribeInstances",
              + "ec2:DescribeNetworkInterfaces",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # data.aws_iam_policy_document.proxy-lambda_fxa-events-sqs-lambda_lambda_sqs_policy_961AB0B5 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "proxy-lambda_fxa-events-sqs-lambda_lambda_sqs_policy_961AB0B5" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:ChangeMessageVisibility",
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:ReceiveMessage",
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # data.aws_sqs_queue.proxy-lambda_fxa-events-sqs-lambda_lambda_sqs_queue_98C8D6B7 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_sqs_queue" "proxy-lambda_fxa-events-sqs-lambda_lambda_sqs_queue_98C8D6B7" {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = "FxAWebhookProxy-Prod-Queue"
      + tags = (known after apply)
      + url  = (known after apply)
    }

  # aws_acm_certificate.apigateway-lambda_fxa-events-apigateway-lambda_api-gateway-certificate_AB4BFA3E will be updated in-place
  ~ resource "aws_acm_certificate" "apigateway-lambda_fxa-events-apigateway-lambda_api-gateway-certificate_AB4BFA3E" {
        id                        = "arn:aws:acm:us-east-1:996905175585:certificate/cfad8aed-2535-4bfe-ab3e-b19a7b763968"
        tags                      = {}
      ~ tags_all                  = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_api_gateway_domain_name.apigateway-lambda_fxa-events-apigateway-lambda_api-gateway-domain-name_AAD407DE will be updated in-place
  ~ resource "aws_api_gateway_domain_name" "apigateway-lambda_fxa-events-apigateway-lambda_api-gateway-domain-name_AAD407DE" {
        id                                     = "fxa-events.getpocket.com"
        tags                                   = {}
      ~ tags_all                               = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_api_gateway_rest_api.apigateway-lambda_api-gateway-rest_FD4A1018 will be updated in-place
  ~ resource "aws_api_gateway_rest_api" "apigateway-lambda_api-gateway-rest_FD4A1018" {
        id                           = "b1aoz7w8yj"
        name                         = "FxAWebhookProxy-Prod-API-Gateway"
        tags                         = {}
      ~ tags_all                     = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9 will be updated in-place
  ~ resource "aws_api_gateway_stage" "apigateway-lambda_api-gateway-stage_E95B0DF9" {
        id                    = "ags-b1aoz7w8yj-prod"
        tags                  = {}
      ~ tags_all              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_log-group_FCA0AB36 will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_log-group_FCA0AB36" {
        id                = "/aws/lambda/FxAWebhookProxy-Prod-ApiGateway-FxA-Events-Function"
        name              = "/aws/lambda/FxAWebhookProxy-Prod-ApiGateway-FxA-Events-Function"
        tags              = {}
      ~ tags_all          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.proxy-lambda_fxa-events-sqs-lambda_log-group_026C85E5 will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "proxy-lambda_fxa-events-sqs-lambda_log-group_026C85E5" {
        id                = "/aws/lambda/FxAWebhookProxy-Prod-Sqs-FxA-Events-Function"
        name              = "/aws/lambda/FxAWebhookProxy-Prod-Sqs-FxA-Events-Function"
      ~ tags              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "FxAWebhookProxy"
        }
      ~ tags_all          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # aws_codedeploy_app.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-app_36CDF2A9 will be updated in-place
  ~ resource "aws_codedeploy_app" "apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-app_36CDF2A9" {
        id                  = "c743b0db-f0eb-4ac4-a22a-7a5df292fbbf:FxAWebhookProxy-Prod-ApiGateway-FxA-Events-Lambda"
        name                = "FxAWebhookProxy-Prod-ApiGateway-FxA-Events-Lambda"
        tags                = {}
      ~ tags_all            = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_codedeploy_app.proxy-lambda_fxa-events-sqs-lambda_lambda-code-deploy_code-deploy-app_BC3071ED will be updated in-place
  ~ resource "aws_codedeploy_app" "proxy-lambda_fxa-events-sqs-lambda_lambda-code-deploy_code-deploy-app_BC3071ED" {
        id                  = "ef18be86-939c-41e9-95eb-d8e6e63d755e:FxAWebhookProxy-Prod-Sqs-FxA-Events-Lambda"
        name                = "FxAWebhookProxy-Prod-Sqs-FxA-Events-Lambda"
        tags                = {}
      ~ tags_all            = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_codedeploy_deployment_group.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda-code-deploy_code-deployment-group_C7221F61 will be updated in-place
  ~ resource "aws_codedeploy_deployment_group" "apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda-code-deploy_code-deployment-group_C7221F61" {
        id                          = "e220cd6d-dc1e-4b35-864d-e6e86e24def0"
        tags                        = {}
      ~ tags_all                    = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_codedeploy_deployment_group.proxy-lambda_fxa-events-sqs-lambda_lambda-code-deploy_code-deployment-group_768043C9 will be updated in-place
  ~ resource "aws_codedeploy_deployment_group" "proxy-lambda_fxa-events-sqs-lambda_lambda-code-deploy_code-deployment-group_768043C9" {
        id                          = "75c2695d-584a-453c-996c-04b468258199"
        tags                        = {}
      ~ tags_all                    = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_iam_policy.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_execution-policy_3C519FF1 will be updated in-place
  ~ resource "aws_iam_policy" "apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_execution-policy_3C519FF1" {
        id               = "arn:aws:iam::996905175585:policy/FxAWebhookProxy-Prod-ApiGateway-FxA-Events-ExecutionRolePolicy"
        name             = "FxAWebhookProxy-Prod-ApiGateway-FxA-Events-ExecutionRolePolicy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:*:*:*"
                    },
                  - {
                      - Action   = [
                          - "sqs:SendMessageBatch",
                          - "sqs:SendMessage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:us-east-1:996905175585:FxAWebhookProxy-Prod-Queue"
                    },
                  - {
                      - Action   = [
                          - "ec2:DescribeNetworkInterfaces",
                          - "ec2:DescribeInstances",
                          - "ec2:DeleteNetworkInterface",
                          - "ec2:CreateNetworkInterface",
                          - "ec2:AttachNetworkInterface",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
      ~ tags_all         = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # aws_iam_policy.proxy-lambda_fxa-events-sqs-lambda_execution-policy_42E5C2FC will be updated in-place
  ~ resource "aws_iam_policy" "proxy-lambda_fxa-events-sqs-lambda_execution-policy_42E5C2FC" {
        id               = "arn:aws:iam::996905175585:policy/FxAWebhookProxy-Prod-Sqs-FxA-Events-ExecutionRolePolicy"
        name             = "FxAWebhookProxy-Prod-Sqs-FxA-Events-ExecutionRolePolicy"
      ~ tags             = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "FxAWebhookProxy"
        }
      ~ tags_all         = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.proxy-lambda_fxa-events-sqs-lambda_sqs-policy_C749EED1 will be updated in-place
  ~ resource "aws_iam_policy" "proxy-lambda_fxa-events-sqs-lambda_sqs-policy_C749EED1" {
        id               = "arn:aws:iam::996905175585:policy/FxAWebhookProxy-Prod-Sqs-FxA-Events-LambdaSQSPolicy"
        name             = "FxAWebhookProxy-Prod-Sqs-FxA-Events-LambdaSQSPolicy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "sqs:SendMessage",
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:DeleteMessage",
                          - "sqs:ChangeMessageVisibility",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:us-east-1:996905175585:FxAWebhookProxy-Prod-Queue"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ tags             = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "FxAWebhookProxy"
        }
      ~ tags_all         = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # aws_iam_role.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_execution-role_0FCA3369 will be updated in-place
  ~ resource "aws_iam_role" "apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_execution-role_0FCA3369" {
        id                    = "FxAWebhookProxy-Prod-ApiGateway-FxA-Events-ExecutionRole"
        name                  = "FxAWebhookProxy-Prod-ApiGateway-FxA-Events-ExecutionRole"
        tags                  = {}
      ~ tags_all              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # aws_iam_role.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-role_2351D7DE will be updated in-place
  ~ resource "aws_iam_role" "apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-role_2351D7DE" {
        id                    = "FxAWebhookProxy-Prod-ApiGateway-FxA-Events-CodeDeployRole"
        name                  = "FxAWebhookProxy-Prod-ApiGateway-FxA-Events-CodeDeployRole"
        tags                  = {}
      ~ tags_all              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # aws_iam_role.proxy-lambda_fxa-events-sqs-lambda_execution-role_49DCFF7B will be updated in-place
  ~ resource "aws_iam_role" "proxy-lambda_fxa-events-sqs-lambda_execution-role_49DCFF7B" {
        id                    = "FxAWebhookProxy-Prod-Sqs-FxA-Events-ExecutionRole"
        name                  = "FxAWebhookProxy-Prod-Sqs-FxA-Events-ExecutionRole"
      ~ tags                  = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "FxAWebhookProxy"
        }
      ~ tags_all              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # aws_iam_role.proxy-lambda_fxa-events-sqs-lambda_lambda-code-deploy_code-deploy-role_EAFFD8C6 will be updated in-place
  ~ resource "aws_iam_role" "proxy-lambda_fxa-events-sqs-lambda_lambda-code-deploy_code-deploy-role_EAFFD8C6" {
        id                    = "FxAWebhookProxy-Prod-Sqs-FxA-Events-CodeDeployRole"
        name                  = "FxAWebhookProxy-Prod-Sqs-FxA-Events-CodeDeployRole"
        tags                  = {}
      ~ tags_all              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # aws_lambda_event_source_mapping.proxy-lambda_fxa-events-sqs-lambda_lambda_event_source_mapping_0005C71C must be replaced
-/+ resource "aws_lambda_event_source_mapping" "proxy-lambda_fxa-events-sqs-lambda_lambda_event_source_mapping_0005C71C" {
      - bisect_batch_on_function_error     = false -> null
      ~ event_source_arn                   = "arn:aws:sqs:us-east-1:996905175585:FxAWebhookProxy-Prod-Queue" # forces replacement -> (known after apply) # forces replacement
      ~ function_arn                       = "arn:aws:lambda:us-east-1:996905175585:function:FxAWebhookProxy-Prod-Sqs-FxA-Events-Function:DEPLOYED" -> (known after apply)
      - function_response_types            = [] -> null
      ~ id                                 = "da98e606-77fe-4658-9006-3d8a8f630631" -> (known after apply)
      ~ last_modified                      = "2024-04-02T16:47:01Z" -> (known after apply)
      + last_processing_result             = (known after apply)
      ~ maximum_record_age_in_seconds      = 0 -> (known after apply)
      ~ maximum_retry_attempts             = 0 -> (known after apply)
      ~ parallelization_factor             = 0 -> (known after apply)
      - queues                             = [] -> null
      ~ state                              = "Enabled" -> (known after apply)
      ~ state_transition_reason            = "USER_INITIATED" -> (known after apply)
      - topics                             = [] -> null
      - tumbling_window_in_seconds         = 0 -> null
      ~ uuid                               = "da98e606-77fe-4658-9006-3d8a8f630631" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_lambda_function.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_06645171 will be updated in-place
  ~ resource "aws_lambda_function" "apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_06645171" {
        id                             = "FxAWebhookProxy-Prod-ApiGateway-FxA-Events-Function"
        tags                           = {}
      ~ tags_all                       = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.proxy-lambda_fxa-events-sqs-lambda_39345609 will be updated in-place
  ~ resource "aws_lambda_function" "proxy-lambda_fxa-events-sqs-lambda_39345609" {
        id                             = "FxAWebhookProxy-Prod-Sqs-FxA-Events-Function"
      ~ tags                           = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "FxAWebhookProxy"
        }
      ~ tags_all                       = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_route53_zone.apigateway-lambda_fxa-events-apigateway-lambda_base-dns_subhosted_zone_8A609C89 will be updated in-place
  ~ resource "aws_route53_zone" "apigateway-lambda_fxa-events-apigateway-lambda_base-dns_subhosted_zone_8A609C89" {
        id                  = "Z03974732S55G3DTUY81O"
        name                = "fxa-events.getpocket.com"
        tags                = {}
      ~ tags_all            = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # aws_s3_bucket.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_code-bucket_C7C951C2 will be updated in-place
  ~ resource "aws_s3_bucket" "apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_code-bucket_C7C951C2" {
        id                          = "pocket-fxawebhookproxy-prod-apigateway-fxa-events"
        tags                        = {}
      ~ tags_all                    = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket.proxy-lambda_fxa-events-sqs-lambda_code-bucket_18BE403F will be updated in-place
  ~ resource "aws_s3_bucket" "proxy-lambda_fxa-events-sqs-lambda_code-bucket_18BE403F" {
        id                          = "pocket-fxawebhookproxy-prod-sqs-fxa-events"
      ~ tags                        = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "FxAWebhookProxy"
        }
      ~ tags_all                    = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_sns_topic.pagerduty_alarm-critical-topic_F1534579 will be updated in-place
  ~ resource "aws_sns_topic" "pagerduty_alarm-critical-topic_F1534579" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:FxAWebhookProxy-Prod-Infrastructure-Alarm-Critical"
        name                                     = "FxAWebhookProxy-Prod-Infrastructure-Alarm-Critical"
        tags                                     = {}
      ~ tags_all                                 = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (28 unchanged attributes hidden)
    }

  # aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3 will be updated in-place
  ~ resource "aws_sns_topic" "pagerduty_alarm-non-critical-topic_53C1A3B3" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:FxAWebhookProxy-Prod-Infrastructure-Alarm-Non-Critical"
        name                                     = "FxAWebhookProxy-Prod-Infrastructure-Alarm-Non-Critical"
        tags                                     = {}
      ~ tags_all                                 = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (28 unchanged attributes hidden)
    }

  # aws_sqs_queue.sqs-queue_redrive_sqs_queue_7787A983 will be updated in-place
  ~ resource "aws_sqs_queue" "sqs-queue_redrive_sqs_queue_7787A983" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/FxAWebhookProxy-Prod-Queue-Deadletter"
        name                              = "FxAWebhookProxy-Prod-Queue-Deadletter"
        tags                              = {}
      ~ tags_all                          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # aws_sqs_queue.sqs-queue_sqs_queue_46EA6754 will be updated in-place
  ~ resource "aws_sqs_queue" "sqs-queue_sqs_queue_46EA6754" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/FxAWebhookProxy-Prod-Queue"
        name                              = "FxAWebhookProxy-Prod-Queue"
        tags                              = {}
      ~ tags_all                          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-fxawebhookproxy"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

Plan: 1 to add, 26 to change, 1 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"482ecaf0-10d0-4fd4-ba50-a9c57973b46e","JobName":"fxa-webhook-proxy_infrastructure_plan_prod","PRNumber":573,"Program":"tfcmt","SHA1":"cc72844cdb0e77d702d3220991a9c168d02a7194","Target":"fxa-webhook-proxy-cdk","Vars":{}} -->